# vsoWidgetSetVisible

## Description
```pascal
PROCEDURE vsoWidgetSetVisible(
				widgetID : LONGINT;
				visible  : BOOLEAN);
```

```python

def vs.vsoWidgetSetVisible(widgetID, visible):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|visible|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events